{"label":"ADDRESS","description":"Street or mailing addresses in Singapore, e.g., 1 North Bridge Road, 80 Marine Parade Road."}
{"label":"EVENT","description":"Named events or occasions in Singapore, including national and public holidays such as Chinese New Year and National Day."}
{"label":"FACILITY","description":"Public or private facilities in Singapore, e.g., hawker centres like Lau Pa Sat; community clubs like Bishan Community Club; government service centres like CPF Service Centre; fitness centres like ActiveSG Gym."}
{"label":"BUILDING","description":"Building structures in Singapore, e.g., HDB residential blocks like Block 123 Tampines Street 11; mixed-use HDB developments like Punggol Edge; condominiums like The Interlace; landed estates like Serangoon Garden Terrace; office towers like One Raffles Place; retail malls like VivoCity; business parks like one-north; JTC factories like CleanTech Park; institutional buildings such as Raffles Institution, Singapore General Hospital, or Parliament House."}
{"label":"TRANSPORT","description":"Transport facilities and services in Singapore, e.g., MRT stations like Dhoby Ghaut; LRT stations like Punggol LRT; bus stops with codes (e.g., 81149 Orchard Road); expressways like the Pan Island Expressway; local streets like Bukit Timah Road; airports like Singapore Changi Airport; ferry terminals like Tanah Merah Ferry Terminal."}
{"label":"EDUCATION","description":"Educational institutions in Singapore, from preschools like My First Skool to primary schools like Raffles Girls’ Primary School; secondary schools like Hwa Chong Institution; junior colleges like Victoria Junior College; polytechnics like Ngee Ann Polytechnic; universities like the National University of Singapore; private tertiary institutions like James Cook University Singapore."}
{"label":"HEALTH","description":"Healthcare institutions and services in Singapore, e.g., government polyclinics like Ang Mo Kio Polyclinic; hospitals like KK Women’s and Children’s Hospital."}
{"label":"ORGANIZATION","description":"Organizations, companies, or institutions in Singapore, e.g., ministries like the Ministry of Education; statutory boards like NParks; political parties like the People’s Action Party; town councils like Ang Mo Kio Town Council; construction firms like Woh Hup; supermarket chains like NTUC FairPrice; banks like DBS Bank; maritime operators like PSA International; nonprofit organizations like Singapore Red Cross."}
{"label":"CULTURE","description":"Cultural sites, institutions, or elements in Singapore, e.g., national monuments like the Singapore Botanic Gardens; museums like the National Museum of Singapore; religious sites like Sultan Mosque; tourist attractions like Gardens by the Bay; local cuisines like Hainanese Chicken Rice."}
{"label":"NATURE","description":"Natural features and green spaces in Singapore, e.g., parks like East Coast Park; reservoirs like MacRitchie Reservoir; heritage trees like the NParks Tembusu; green corridors like the Bukit Timah Railway Green Corridor."}
{"label":"LAND_USE","description":"Designated land parcel usage in Singapore, e.g., residential areas like Tengah; commercial zones like Marina Bay Financial Centre; industrial areas like Jurong Island; greenspaces like Bishan-Ang Mo Kio Park; utility sites like Changi Water Reclamation Plant."}
{"label":"PEOPLE","description":"Named individuals or public figures in Singapore, including government officials like Prime Minister Lee Hsien Loong; national representatives like Ambassador Chan Heng Chee; and other public figures."}
{"label":"POLICY","description":"Government policies, schemes, or initiatives in Singapore, e.g., Build-To-Order housing; MediShield Life healthcare; SkillsFuture education; Certificate of Entitlement transport; Green Plan 2030 environmental; Smart Nation digital government; ComCare social support; Industry Transformation Maps economic development; Baby Bonus family; Total Defence security."}
{"label":"SUBSTANCE","description":"Controlled or regulated substances under Singapore law, e.g., illegal narcotics like heroin and cocaine; psychoactive substances like cannabis and ecstasy."}
{"label":"ADMINISTRATIVE_DIVISION","description":"Administrative divisions in Singapore, such as planning areas or constituencies, e.g., Ang Mo Kio, Marine Parade GRC."}
{"label":"INFRASTRUCTURE","description":"Infrastructure systems in Singapore, e.g., the MRT network; expressways like the East Coast Parkway."}
{"label":"RETAIL","description":"Retail establishments in Singapore, e.g., shopping malls like Ion Orchard; supermarkets like Cold Storage."}
{"label":"ENTERTAINMENT","description":"Entertainment venues in Singapore, e.g., cinemas like Shaw Theatres; theatres and concert halls like the Esplanade; stadiums like the National Stadium."}
{"label":"MISC","description":"Miscellaneous items not covered by other labels."}
