{"label":"Address or Location","description":"Street or mailing addresses in Singapore, e.g., 1 North Bridge Road, 80 Marine Parade Road, Punggol, Sengkang"}
{"label":"Public Holiday","description":"National and public holidays observed in Singapore, e.g., Chinese New Year, National Day."}
{"label":"Hawker Centre","description":"Open-air food courts selling local dishes in Singapore, e.g., Lau Pa Sat, Maxwell Food Centre."}
{"label":"Community Club","description":"Local community centers offering recreational activities and classes in Singapore, e.g., Bishan Community Club, Tampines West Community Club."}
{"label":"Government Service Centre","description":"Government-run service centers providing public services in Singapore, e.g., CPF Service Centre, HDB Branch Office."}
{"label":"Public Facilities","description":"Publicly accessible community and recreational facilities in Singapore, including gyms and fitness centres, libraries, community halls, sports complexes, e.g., ActiveSG Gym at Yio Chu Kang, Virgin Active Fitness Club, Toa Payoh Public Library, Bukit Panjang Community Club."}
{"label":"HDB Block","description":"Public housing blocks managed by HDB in Singapore, e.g., Block 123 Tampines Street 11, Block 45 Toa Payoh HDB."}
{"label":"Condominium","description":"Privately-owned condominium complexes in Singapore, e.g., The Interlace, Marina Bay Residences."}
{"label":"Landed Property","description":"Privately owned landed properties like terrace houses and bungalows in Singapore, e.g., Serangoon Garden Terrace, Bukit Timah bungalow."}
{"label":"Office Tower","description":"High-rise office buildings in Singapore, e.g., One Raffles Place, CapitaGreen."}
{"label":"Retail Mall","description":"Shopping centers and malls in Singapore, e.g., VivoCity, Ion Orchard."}
{"label":"Hotel","description":"Hotels and accommodation establishments in Singapore, e.g., Pan Pacific Singapore, Raffles Hotel, Marina Bay Sands."}
{"label":"Government Building","description":"Government-owned buildings and offices in Singapore, e.g., Parliament House, Istana."}
{"label":"MRT Station","description":"Mass Rapid Transit stations in Singapore, e.g., Dhoby Ghaut, Orchard Station."}
{"label":"LRT Station","description":"Light Rail Transit stations in Singapore, e.g., Punggol LRT, Sengkang LRT."}
{"label":"Bus Stop","description":"Public bus stops in Singapore with official bus stop codes, e.g., 81149 Orchard Road, 48011 Ang Mo Kio."}
{"label":"Expressway","description":"Major highways and expressways in Singapore, e.g., Pan Island Expressway (PIE), East Coast Parkway (ECP)."}
{"label":"Local Street","description":"Local roads and streets in Singapore, e.g., Bukit Timah Road, East Coast Road."}
{"label":"Airport","description":"Air transport terminals in Singapore, e.g., Singapore Changi Airport, Seletar Airport."}
{"label":"Ferry Terminal","description":"Marine ferry terminals in Singapore, e.g., Tanah Merah Ferry Terminal, Marina South Pier."}
{"label":"Preschool","description":"Early childhood education centers in Singapore, e.g., My First Skool, PCF Sparkletots."}
{"label":"Primary School","description":"Government and aided primary schools in Singapore, e.g., Raffles Girls' Primary School, Tao Nan School."}
{"label":"Secondary School","description":"Secondary schools in Singapore, e.g., Hwa Chong Institution, Dunman High School."}
{"label":"Junior College","description":"Junior colleges in Singapore offering pre-university education, e.g., Victoria Junior College, Anderson Junior College."}
{"label":"University","description":"Universities and higher education institutions in Singapore, e.g., National University of Singapore (NUS), Nanyang Technological University (NTU)."}
{"label":"Healthcare Facility","description":"Hospitals, medical centres, specialist clinics and government-run polyclinics in Singapore, e.g., Singapore General Hospital, KK Women's and Children's Hospital, Ang Mo Kio Polyclinic, Bukit Batok Polyclinic."}
{"label":"Private Institute","description":"Private tertiary institutions in Singapore, e.g., James Cook University Singapore, MDIS."}
{"label":"Ministry","description":"Singapore government ministries, e.g., Ministry of Education, Ministry of Health."}
{"label":"Government Agency","description":"Singapore government ministries, statutory boards and other autonomous government organisations, e.g., Ministry of Education, Land Transport Authority (LTA), Economic Development Board (EDB), National Parks Board (NParks), Housing & Development Board (HDB)."}
{"label":"Political Party","description":"Political parties in Singapore, e.g., People's Action Party (PAP), Workers' Party (WP)."}
{"label":"Company","description":"Singapore-registered private enterprises e.g., Grab, Singapore Airlines, Sea Limited, Singtel, ST Engineering"}
{"label":"Supermarket","description":"Supermarket chains in Singapore, e.g., NTUC FairPrice, Cold Storage."}
{"label":"Financial Institution","description":"Banks and financial institutions in Singapore, e.g., DBS Bank, OCBC Bank."}
{"label":"Maritime Operator","description":"Shipping and port operators in Singapore, e.g., PSA International, APL."}
{"label":"Nonprofit Organization","description":"Voluntary welfare and nonprofit organizations in Singapore, e.g., Singapore Red Cross, Mendaki."}
{"label":"National Monument","description":"Officially gazetted national monuments in Singapore, e.g., Singapore Botanic Gardens, Civilian War Memorial."}
{"label":"Museum or Heritage Centre","description":"Museums and heritage institutions in Singapore, e.g., National Museum of Singapore, Asian Civilisations Museum."}
{"label":"Religious Site","description":"Places of worship in Singapore, e.g., Sultan Mosque, Buddha Tooth Relic Temple."}
{"label":"Tourist Attraction","description":"Tourist attractions and landmarks in Singapore, e.g., Gardens by the Bay, Sentosa."}
{"label":"Local Cuisine","description":"Traditional and popular dishes originating from or commonly associated with Singaporean cuisine, e.g., Hainanese Chicken Rice, Laksa, Roti Prata."}
{"label":"Park","description":"Public parks and green spaces in Singapore, e.g., East Coast Park, MacRitchie Reservoir Park."}
{"label":"Reservoir","description":"Water catchment reservoirs in Singapore, e.g., Upper Seletar Reservoir, MacRitchie Reservoir."}
{"label":"Drug Substance","description":"Illegal narcotic drugs controlled under Singapore law, e.g., heroin, cocaine."}
{"label":"Government Official","description":"Elected government officials in Singapore, e.g., Prime Minister Lee Hsien Loong, Deputy Prime Minister Heng Swee Keat."}
{"label":"Public Figure","description":"Public figures and citizens in Singapore mentioned by name."}
{"label":"Housing Policy","description":"National housing policies and initiatives in Singapore, e.g., Build-To-Order (BTO) scheme, Lease Buyback Scheme."}
{"label":"Healthcare Policy","description":"Healthcare-related policies and initiatives in Singapore, e.g., MediShield Life, Community Health Assist Scheme (CHAS)."}
{"label":"Education Policy","description":"Government educational policies and initiatives in Singapore, e.g., SkillsFuture, Edusave Scheme."}
{"label":"Transport Policy","description":"Transport-related initiatives and national policies in Singapore, e.g., Car-lite Initiative, Certificate of Entitlement (COE)."}
{"label":"Environmental Policy","description":"Environmental and sustainability initiatives and policies in Singapore, e.g., Green Plan 2030, Zero Waste Masterplan."}
{"label":"Digital Government Policy","description":"Government digital transformation initiatives in Singapore, e.g., Smart Nation Initiative, National Digital Identity (SingPass)."}
{"label":"Social Support Policy","description":"Social welfare and support schemes in Singapore, e.g., ComCare Assistance, Pioneer Generation Package."}
{"label":"Economic Development Policy","description":"Initiatives aimed at economic growth and development in Singapore, e.g., Industry Transformation Maps (ITMs), Productivity Solutions Grant (PSG)."}
{"label":"Family Policy","description":"Family-focused government policies and schemes in Singapore, e.g., Baby Bonus Scheme, Enhanced Marriage and Parenthood Package."}
{"label":"Security & Defence Policy","description":"National security and defence policies and initiatives in Singapore, e.g., Total Defence, National Service (NS)."}
{"label":"Act","description":"Acts passed by Parliament, e.g., Banking Act."}
{"label":"Regulation","description":"Subsidiary legislation under an Act, e.g., Food Hygiene Regulations."}
{"label":"Media","description":"Singapore-based media outlets, including newspapers (e.g., The Straits Times), TV channels (e.g., CNA), and radio stations (e.g., Class 95FM)."}  
{"label":"Sports","description":"Singapore-based sports teams (e.g., Singapore Lions), major sporting events (e.g., Singapore Grand Prix), and sports venues (e.g., National Stadium)."}
{"label":"Miscellaneous","description":"Any other entities but strictly related to Singapore"}